* Ingredients
  |----------------------------+----------------+----------------+-------+----------------+----------------+------------------+-----------------+-------------+----------------------------+----------------------------+----------------------+----------------------+--------------------------------------------------------|
  | Ingredient                 | Package weight | Package volume |  Cost | Serving weight | Serving volume | Serving calories | Serving protein | Serving fat | Serving backpacking weight | Serving backpacking volume | Cost / 1000 calories | Cost / 100 g protein | Note                                                   |
  |----------------------------+----------------+----------------+-------+----------------+----------------+------------------+-----------------+-------------+----------------------------+----------------------------+----------------------+----------------------+--------------------------------------------------------|
  | 10oz can mushrooms         |                | 284ml          |  0.97 |                | 1/2 cup        |               35 | 2g              | 0g          |                            |                            |               11.710 |               20.493 |                                                        |
  | 14oz can pineapple tidbits |                | 398ml          |  0.97 |                | 125ml          |               70 | 1g              | 0g          |                            |                            |                4.352 |               30.465 | Dole                                                   |
  | 28oz can crushed tomatoes  |                | 796ml          |  1.19 |                | 1/2 cup        |               50 | 3g              | 0g          |                            |                            |                3.588 |                5.980 |                                                        |
  | 28oz can diced tomatoes    |                | 796ml          |  1.19 |                | 1/2 cup        |               30 | 1g              | 0g          |                            |                            |                5.980 |               17.940 |                                                        |
  | 6oz can tomato paste       |                | 156ml          |  0.69 |                | 2 tbsp         |               20 | 1g              | 0g          |                            |                            |                6.635 |               13.269 |                                                        |
  | all-purpose flour          | 10kg           |                |  7.99 | 30g            | 1/4 cup        |              110 | 4g              | 0.5g        |                            |                            |                0.218 |                0.599 |                                                        |
  | baking powder              | 450g           |                |  5.99 | 1g             | 1/4 tsp        |                0 | 0g              | 0g          |                            |                            |                      |                      |                                                        |
  | baking soda                | 2kg            |                |  3.97 | 5.5g           | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |                                                        |
  | balsamic vinegar           |                | 500ml          |  3.17 |                | 1 tbsp         |               15 | 0.1g            | 0g          |                            |                            |                6.340 |               95.100 |                                                        |
  | banana pulp                | 1kg            |                |  1.70 | 343g           | 1 cup          |                  |                 |             |                            |                            |                      |                      |                                                        |
  | basil                      |                |                |       |                |                |                  |                 |             |                            |                            |                      |                      |                                                        |
  | bay leaves                 |                |                |       |                |                |                  |                 |             |                            |                            |                      |                      |                                                        |
  | black pepper               | 400g           |                |  6.29 | 0.5g           | 1/4tsp         |                0 | 0.1             | 0g          |                            |                            |                      |                7.862 |                                                        |
  | capellini                  | 900g           |                |  1.77 | 85g            |                |              310 | 11g             | 1.5g        |                            |                            |                0.539 |                1.520 |                                                        |
  | cashews                    | 908g           |                | 12.98 | 30g            | 1/4 cup        |              180 | 6g              | 14g         |                            | 1/4 cup                    |                2.383 |                7.148 |                                                        |
  | cinnamon                   | 150g           |                |  2.10 | 0.5g           | 1/4 tsp        |                0 |                 |             |                            |                            |                      |                      |                                                        |
  | cloves garlic              | 58g            | 12             |  0.23 | 4.8333g        | 1              |            8.955 | 0.379g          | 0.03g       |                            |                            |                2.140 |                5.057 | 195g for 3 bulbs garlic for 0.58                       |
  | cottage cheese             | 500g           | 16oz           |  3.49 | 125g           | 1/2 cup        |              100 | 14g             | 2.5g        |                            |                            |                8.725 |                6.232 | 2%                                                     |
  | curry powder               | 45g            |                |  6.89 | 0.5g           | 1/4 tsp        |                0 | 0g              | 0g          |                            |                            |                      |                      |                                                        |
  | dark brown sugar           | 1kg            |                |  2.27 | 12g            | 1 tbsp         |               48 | 0g              | 0g          |                            |                            |                0.568 |                      |                                                        |
  | dates                      | 500g           |                |  3.89 | 40g            | 1/2 cup        |              140 | 1g              | 0g          |                            |                            |                2.223 |               31.120 |                                                        |
  | dried apples               | 200g           |                |  3.99 | 40g            | 1/2 cup        |              110 | 0.4g            |             |                            | 1/2 cup                    |                7.255 |              199.500 |                                                        |
  | dried apples               | 200g           |                |  3.99 | 40g            | 1/2 cup        |              110 | 0.4g            |             |                            | 1/2 cup                    |                7.255 |              199.500 |                                                        |
  | dried apricots             | 500g           |                |  4.89 | 40g            | 1/3 cup        |              120 | 1g              |             |                            | 1/3 cup                    |                3.260 |               39.120 | NN                                                     |
  | dried mushrooms            | 113g           |                |  2.99 | 43g            | 1.02 cup       |               70 | 7g              | 0.5g        |                            |                            |               16.254 |               16.254 | shiitake mushrooms purchased from local oriental store |
  | dried parsley              |                |                |       |                |                |                  |                 |             |                            |                            |                      |                      |                                                        |
  | dried tomato               | 85g            |                |  3.79 | 5g             | 1 tbsp         |               15 | 1g              | 0g          |                            |                            |               14.863 |               22.294 | Mezzetta sun-ripened dried tomatos                     |
  | dried vegetables           | 1kg            |                | 11.90 | 39g            | 1/2 cup        |                  |                 |             |                            |                            |                      |                      |                                                        |
  | frozen spinach             | 300g           |                |  1.50 | 75g            |                |               25 | 3g              | 0.5g        |                            |                            |               15.000 |               12.500 |                                                        |
  | large eggs                 |                | 12             |  2.99 | 55g            | 1              |               72 | 6.3g            | 4.8g        |                            |                            |                3.461 |                3.955 |                                                        |
  | lean ground beef           | 0.766 kg       |                |  7.11 | 100g           | 1/2 cup        |              220 | 20g             | 15g         |                            |                            |                4.219 |                4.641 | Superstore                                             |
  | M&Ms                       | 400g           |                |  4.94 | 40g            | 1/4 cup        |              200 | 2g              | 8g          |                            |                            |                2.470 |               24.700 |                                                        |
  | margarine                  | 3lb            |                |  3.47 | 10g            | 2 tsp          |               70 | 0g              | 8g          |                            |                            |                0.364 |                      |                                                        |
  | medium onions              | 1.456kg        | 9              |  2.97 | 141g           |                |               69 | 1.60g           | 0.114g      |                            |                            |                4.168 |               17.976 |                                                        |
  | minute rice                | 2.6kg          |                |  8.79 | 44g            | 1/2 cup        |              160 | 4g              | 0g          |                            |                            |                0.930 |                3.719 |                                                        |
  | mozzarella cheese          | 200g           |                |  3.88 | 30g            | 72ml           |               90 | 9g              | 5g          |                            |                            |                6.467 |                6.467 |                                                        |
  | no-boil lasagna noodles    | 375g           | 22             |  3.47 | 85g            | 5              |              320 | 11g             | 1.5g        |                            |                            |                2.458 |                7.150 | Catelli                                                |
  | nutmeg                     | 100g           |                |  2.99 | 1g             | 1/2 tsp        |                5 |                 |             |                            |                            |                5.980 |                      |                                                        |
  | olive oil                  |                | 3L             | 15.98 |                | 2 tsp          |               80 | 0g              | 9g          |                            |                            |                0.666 |                      |                                                        |
  | Parmesan cheese            | 500g           |                | 10.49 | 12g            | 2 tbsp         |               50 | 4g              | 4g          |                            |                            |                5.035 |                6.294 |                                                        |
  | peanuts                    | 2kg            |                |  8.49 | 45g            | 1/3 cup        |              290 | 10g             | 23g         |                            |                            |                0.659 |                1.910 | NN                                                     |
  | pecans                     | 1kg            |                | 19.99 | 36g            | 1/3 cup        |              270 | 3g              | 26g         |                            |                            |                2.665 |               23.988 | NN halves, want chopped                                |
  | quick oats                 | 2.25kg         |                |  4.99 | 30g            | 1/3 cup        |              110 | 5g              | 2g          |                            |                            |                0.605 |                1.331 |                                                        |
  | raisins                    | 2kg            |                |  7.99 | 40g            | 1/4 cup        |              130 | 1g              | 0g          |                            | 1/4 cup                    |                1.229 |               15.980 | NN Thompson                                            |
  | raisins                    | 2kg            |                |  7.99 | 40g            | 1/4 cup        |              130 | 1g              | 0g          |                            | 1/4 cup                    |                1.229 |               15.980 | NN Thompson                                            |
  | raisins                    | 2kg            |                |  7.99 | 40g            | 1/4 cup        |              130 | 1g              | 0g          |                            | 1/4 cup                    |                1.229 |               15.980 | NN Thompson                                            |
  | red pepper flakes          |                |                |       |                |                |                  |                 |             |                            |                            |                      |                      |                                                        |
  | rolled oats                | 2.25kg         |                |  4.99 | 40g            | 1/3 cup        |              110 | 5g              | 2g          |                            |                            |                0.806 |                1.774 | TODO: need a consistent price/nutrition                |
  | salt                       | 1kg            |                |  2.99 | 1g             | 1/4 tsp        |                0 | 0g              | 0g          |                            |                            |                      |                      |                                                        |
  | sesame seeds               | 150g           |                |  1.59 | 8.5g           | 1 tbsp         |               52 | 1.6g            | 4.5g        |                            |                            |                1.733 |                5.631 |                                                        |
  | shreddies                  | 540g           |                |  4.00 | 50g            | 1 cup          |              180 | 1g              | 4g          |                            | 1 cup                      |                2.058 |               37.037 |                                                        |
  | sliced almonds             | 1kg            |                | 12.99 | 30g            | 1/4 cup        |              190 | 6g              | 16g         |                            |                            |                2.051 |                6.495 |                                                        |
  | strips bacon               | 500g           | 20             |  3.98 | 50g            | 2              |              200 | 4g              | 19g         |                            |                            |                1.990 |                9.950 | (per slice)                                            |
  | traditional yeast          | 227g           |                |  7.98 | 8g             | 2 1/4 tsp      |                0 | 0.3g            | 0g          |                            |                            |                      |               93.744 |                                                        |
  | unsweetened coconut        | 200g           |                |  1.99 | 12g            | 2 tbsp         |               90 | 1g              | 7g          |                            |                            |                1.327 |               11.940 |                                                        |
  | vanilla extract            |                | 250ml          |  3.00 | 5g             | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |                                                        |
  | vegetable oil              |                | 3L             |  5.99 | 14g            | 2 tsp          |               80 | 0g              | 9g          |                            |                            |                0.250 |                      | using canola oil, TODO: get nutrition for best price   |
  | veggie bullion powder      | 150g           |                |  5.99 | 3.4g           | 1 tsp          |               10 | 0.1g            | 0g          |                            |                            |               13.577 |              135.773 |                                                        |
  | walnuts                    | 1kg            |                | 12.99 | 40g            | 1/3 cup        |              280 | 6g              | 26g         |                            | 1/3 cup                    |                1.856 |                8.660 | NN pieces                                              |
  | walnuts                    | 1kg            |                | 12.99 | 40g            | 1/3 cup        |              280 | 6g              | 26g         |                            | 1/3 cup                    |                1.856 |                8.660 | NN pieces                                              |
  | wheat germ                 | 375g           |                |  2.98 | 16g            | 3 tbsp         |               60 | 5g              | 1.5g        |                            |                            |                2.119 |                2.543 |                                                        |
  | white sugar                | 4kg            |                |  5.27 | 12g            | 1 tbsp         |               48 | 0g              | 0g          |                            |                            |                0.329 |                      |                                                        |
  | whole-wheat flour          | 5kg            |                |  4.98 | 30g            | 1/4 cup        |              110 | 4g              | 0.5g        |                            |                            |                0.272 |                0.747 |                                                        |
  | Worcestershire sauce       |                | 291ml          |  2.00 |                | 1 tsp          |                0 | 0g              | 0g          |                            |                            |                      |                      |                                                        |
  |----------------------------+----------------+----------------+-------+----------------+----------------+------------------+-----------------+-------------+----------------------------+----------------------------+----------------------+----------------------+--------------------------------------------------------|
  #+TBLFM: $12='(nts-nan (ignore-errors (otdb-recipe-database-calorie-costs $2 $3 $4 $5 $6 $7)))::$13='(nts-nan (ignore-errors (otdb-recipe-database-protein-costs $2 $3 $4 $5 $6 $8)))
